1) Сделайте функцию, которая возвращает квадрат числа. Число передается параметром.

1) Сделайте функцию, которая возвращает сумму двух чисел. Числа передаются параметрами функции.

1) Сделайте функцию, которая отнимает от первого числа второе и делит на третье.

1) Сделайте функцию, которая принимает параметром число от 1 до 7, а возвращает день недели на русском языке.

1) Напишите функцию преобразования строки в CamelCase: Преобразуйте строку 'var_test_text' в 'varTestText'. Скрипт, конечно же, должен работать с любыми аналогичными строками.

1) Напишите функцию с переменным числом аргуметов, которая выводит среднее арифметическое введенных чисел.

1) Заполните массив 10-ю случайными числами от 1 до 10 так, чтобы они не повторялись.

1) Сделайте функцию getCommonDivisors, которая параметром принимает 2 числа и выводит список их общих делителей.

1) Сделайте функцию, которая принимает строку на русском языке, а возвращает ее транслит.

1) Сделайте функцию, которая возвращает множественное или единственное число существительного. Пример: 1 яблоко, 2 (3, 4) яблока, 5 яблок. Функция первым параметром принимает число, а следующие 3 параметра — форма для единственного числа, для чисел два, три, четыре и для чисел, больших четырех, например, func(3, 'яблоко', 'яблока', 'яблок').

1) Дано число. Сложите его цифры. Если сумма получилась более 9-ти, опять сложите его цифры. И так, пока сумма не станет однозначным числом (9 и менее).