1) Сделайте функцию, которая возвращает квадрат числа. Число передается параметром.

1) Сделайте функцию, которая возвращает сумму двух чисел. Числа передаются параметрами функции.

1) Сделайте функцию, которая отнимает от первого числа второе и делит на третье.

1) Сделайте функцию, которая принимает параметром число от 1 до 7, а возвращает день недели на русском языке.

1) Напишите функцию преобразования строки в CamelCase: Преобразуйте строку 'var_test_text' в 'varTestText'. Скрипт, конечно же, должен работать с любыми аналогичными строками.